
#Region ПрограммныйИнтерфейс


// Выполнить пересчет полей строки табличной части.
// 
// Parameters:
//  Форма Форма
//  ИмяТабличнойЧасти - Имя табличной части
//  ИдентификаторСтроки - Идентификатор строки
//  ИмяПоля - Имя измененного поля
Процедура ВыполнитьПересчетПолейСтрокиТабличнойЧасти(Форма, ИмяТабличнойЧасти, ИдентификаторСтроки, ИмяПоля) Экспорт
	
	СтрокаДанных = Форма.Object[ИмяТабличнойЧасти].НайтиПоИдентификатору(ИдентификаторСтроки);
	
	Если СтрокаДанных = Неопределено Тогда
		Возврат;	
	КонецЕсли;	 
	
	Если ИмяПоля = "Цена" ИЛИ ИмяПоля = "Количество" Тогда

		СтрокаДанных.Сумма = СтрокаДанных.Цена * СтрокаДанных.Количество;
	
	КонецЕсли;
	
КонецПроцедуры

#EndRegion
